/******************************************************************************
文 件 名   : dgus.h
版 本 号   : V1.0
作    者   : pinot
生成日期   : 2020年04月13日
功能描述   : 读写DGUS变量存储器
修改历史   :
日    期   :
作    者   :
修改内容   :
******************************************************************************/

#ifndef _DGUS_H_
#define _DGUS_H_

/*****************************************************************************
系统库*/

/*****************************************************************************
自定义头文件*/
#include "sys.h"

/*****************************************************************************
宏定义变量*/
//系统变量接口
#define DHW_NORFLASH_RWCMD      0x0008        //norflash读写接口
#define DHW_NPAGE               0x0014        //当前页面
#define DHW_XCOOR               0x0017        //X坐标
#define DHW_YCOOR               0x0018        //Y坐标
#define DHW_LEDNOW              0x0031        //LED背光状态
#define DHW_SYSCFG              0x0080        //系统配置
#define DHW_LEDCFG              0x0082        //LED背光配置
#define DHW_SPAGE               0x0084        //设置页面
#define DHW_0F00                0x0F00        //变量改变指示


/*****************************************************************************
对外函数声明*/
void ReadDGUS(uint16_t Addr, uint8_t *pBuf, uint16_t Len);
void WriteDGUS(uint16_t Addr, uint8_t *pBuf, uint16_t Len);

#endif