/******************************************************************************
文 件 名   : handle.h
版 本 号   : V1.0
作    者   : pinot
生成日期   : 2020年04月13日
功能描述   : 逻辑处理
修改历史   :
日    期   :
作    者   :
修改内容   :
******************************************************************************/

#ifndef _HANDLE_H_
#define _HANDLE_H_

/*****************************************************************************
系统库*/

/*****************************************************************************
自定义头文件*/
#include "sys.h"

/*****************************************************************************
宏定义变量*/
//页面ID

//显示变量


//触控变量


//参数配置


//数据库地址


//调试助手


#define UDEBUG                 0
#if UDEBUG
  #define LOG(x,y)    { Uart2SendStr(x,y); }
//#define LOG(x,y)    { Uart3SendStr(x,y); }
//#define LOG(x,y)    { Uart4SendStr(x,y); }
//#define LOG(x,y)    { Uart5SendStr(x,y); }
#else
  #define LOG(x,y)    { ; }
#endif

/*****************************************************************************
对外函数声明*/
void InitUartSend(void);
void HandleProc(void);

#endif