/******************************************************************************
* 文 件 名   : timer.c
* 版 本 号   : V1.0
* 作    者   : pinot
* 生成日期   : 2020年04月13日
* 功能描述   : 定时器应用
* 修改历史   :
* 日    期   :
* 作    者   :
* 修改内容   :
******************************************************************************/

/*****************************************************************************
自定义头文件*/
#include "timer.h"

/*****************************************************************************
全局变量*/
uint16_t timecount;
uint16_t uart5timecount;

uint16_t SystickCount;


/*****************************************************************************
定时器0*/
void T0_Init(void)
{
  TMOD|=0x01;
  TH0=T1MS>>8;        //1ms定时器
  TL0=T1MS;
  ET0=1;              //开启定时器0中断
  TR0=1;              //开启定时器
}
void T0_ISR_PC(void)    interrupt 1
{
	EA=0;
	TH0=T1MS>>8;
	TL0=T1MS;
	if(timecount > 0)
		timecount--;

	uart5timecount++;
	SystickCount++;
	WDT_RST();
	EA=1;
}
/*****************************************************************************
定时器2*/
//void T2_Init(void)
//{
//  T2CON=0x70;
//  TH2=0x00;
//  TL2=0x00;
//  TRL2H=0xBC;
//  TRL2L=0xCD;        //1ms的定时器
//  IEN0|=0x20;        //开启定时器2
//  TR2=0x01;
//}
//void T2_ISR_PC(void)    interrupt 5
//{
//  TF2=0;    
////  WDT_RST();
//}


/*****************************************************************************
定时器总配置*/
void InitTimer(void)
{
  T0_Init();
//  T2_Init();
}

uint8_t Pull_SystickCount(void)
{
    uint8_t Read_Int8u;
    
    Read_Int8u=SystickCount;
    return(Read_Int8u);
}


